{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Introduction:\n",
    "### Neo4J:\n",
    "   <a href=\"https://neo4j.com/\">Neo4J</a>  is a graph database management system developed by Neo4j, Inc. Described by its developers as a native graph storage and processing. It is the most popular graph database according to DB-Engines ranking, and the 22nd most popular database overall.<br/>\n",
    "<img src=\"https://neo4j.com/wp-content/themes/neo4jweb/assets/images/neo4j-logo-2015.png\">\n",
    "\n",
    "\n",
    "### The Property Graph Model\n",
    "* In the property graph model, data is organized as nodes, relationships, and properties (data stored on the nodes or relationships).\n",
    "\n",
    "<img src= 'https://dist.neo4j.com/wp-content/uploads/property_graph_elements.jpg' width='600'>\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  Cypher Query Language\n",
    "\n",
    "Cypher is Neo4j’s graph query language that allows users to store and retrieve data from the graph database. Cypher’s syntax provides a visual and logical way to match patterns of nodes and relationships in the graph.\n",
    "t is a declarative, SQL-inspired language for describing visual patterns in graphs using ASCII-Art syntax. It allows us to state what we want to select, insert, update, or delete from our graph data without a description of exactly how to do it.\n",
    "\n",
    "- First Steps with Cypher can be followed from this <a href='https://neo4j.com/developer/cypher/'>link </a>.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Pre-Lab:\n",
    "### Installation\n",
    "\n",
    "1. Install neo4j 3.5 Community Edition followin this <a href='https://neo4j.com/download-thanks/?edition=community&release=3.5.21&flavour=winzip&_ga=2.186751336.1137015944.1598288824-1813280835.1541597058'>link </a>\n",
    "\n",
    "\n",
    "Note:\n",
    "\n",
    " * Click  <a href= 'https://neo4j.com/download-thanks-desktop/?edition=desktop&flavour=winstall64&release=1.3.4&offline=true'> here </a> to download the latest version of neo4j DeskTop for Windows.\n",
    " * Follow the installation guide provided <a href= 'https://neo4j.com/download-thanks-desktop/?edition=desktop&flavour=winstall64&release=1.3.4&offline=true#installation-guide' > here </a> to download, install neo4j DEsktop on your Windows.\n",
    " * make sure that you run Neo4j as a console application, use: \n",
    "     - <b> NEO4J_HOME\\bin\\neo4j console </b>\n",
    "     - Or install Neo4j as a service using: <b>NEO4J_HOME\\bin\\neo4j install-service </b>\n",
    " "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "2. We can use the <b> \"Neo4j Python\" </b> driver which is officially supported by Neo4j and connects to the database using the binary protocol.\n",
    "It aims to be minimal, while being idiomatic to Python. <a href=\"https://neo4j.com/developer/python/\">here</a>:\n",
    "```\n",
    "pip install neo4j\n",
    "``` "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ipython-cypher\n",
    "[ipython-cypher](https://github.com/versae/ipython-cypher) is another way to connect to a graph database in python. it uses <b> neo4jrestclient_ driver </b>, then issue Cypher commands within IPython or IPython Notebook.\n",
    "#### ipython-cypher install"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "! pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Inside IPython, load the extension:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### And then you are reay to go by using the <b>%cypher</b> or <b>%%cypher</b> line magic:\n",
    "\n",
    "you have to write down the connection url http://username:password@127.0.0.1:7474/db/data after the %%cypher to access your active DB using the neo4j http port (7474)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- '''%cypher''' is intended for one-line Cypher queries and '''%%cypher''' is intended for multi-line Cypher queries. \n",
    "- Placing \"%%cypher\" above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 1: Movie-graph DB\n",
    "The Movie Graph is a mini graph application containing actors and directors that are related through the movies they've collaborated on.\n",
    "\n",
    "- The \"Movies graph DB\" example, is launched via the <font color='red'>:play movie-graph</font> command in your neo4j web UI/browser and contains a small graph of movies and people related to those movies as actors, directors, producers etc.\n",
    "\n",
    "<img src='https://storage.googleapis.com/kaggle-datasets-images/1365/2460/229bfb5d3dd1a49cc5ac899c45ca2213/dataset-original.png' width=\"400\" height=\"100\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Perform some queries on the Graph database using Cypher Query Language.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Simplified Schema with labels of DB:\n",
    "- Run this command in your broswer **Call db.schema()** "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"schema1.png\" alt=\"3\" border=\"0\"  width=\"400\" height=\"100\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get all people nodes in the Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "133 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Lilly Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Lana Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1952, &#x27;name&#x27;: &#x27;Joel Silver&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1978, &#x27;name&#x27;: &#x27;Emil Eifrem&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1975, &#x27;name&#x27;: &#x27;Charlize Theron&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;Al Pacino&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1944, &#x27;name&#x27;: &#x27;Taylor Hackford&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Tom Cruise&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1937, &#x27;name&#x27;: &#x27;Jack Nicholson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Demi Moore&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Kevin Bacon&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;Kiefer Sutherland&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Noah Wyle&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Cuba Gooding Jr.&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Kevin Pollak&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1943, &#x27;name&#x27;: &#x27;J.T. Walsh&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;James Marshall&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1948, &#x27;name&#x27;: &#x27;Christopher Guest&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1947, &#x27;name&#x27;: &#x27;Rob Reiner&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Aaron Sorkin&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Kelly McGillis&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1959, &#x27;name&#x27;: &#x27;Val Kilmer&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Anthony Edwards&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1933, &#x27;name&#x27;: &#x27;Tom Skerritt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Meg Ryan&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1944, &#x27;name&#x27;: &#x27;Tony Scott&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1941, &#x27;name&#x27;: &#x27;Jim Cash&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1969, &#x27;name&#x27;: &#x27;Renee Zellweger&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Kelly Preston&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1974, &#x27;name&#x27;: &quot;Jerry O&#x27;Connell&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1970, &#x27;name&#x27;: &#x27;Jay Mohr&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Bonnie Hunt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Regina King&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1996, &#x27;name&#x27;: &#x27;Jonathan Lipnicki&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Cameron Crowe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1970, &#x27;name&#x27;: &#x27;River Phoenix&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Corey Feldman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1972, &#x27;name&#x27;: &#x27;Wil Wheaton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;John Cusack&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1942, &#x27;name&#x27;: &#x27;Marshall Bell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Helen Hunt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Greg Kinnear&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;James L. Brooks&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Annabella Sciorra&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1929, &#x27;name&#x27;: &#x27;Max von Sydow&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1942, &#x27;name&#x27;: &#x27;Werner Herzog&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1951, &#x27;name&#x27;: &#x27;Robin Williams&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Vincent Ward&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1970, &#x27;name&#x27;: &#x27;Ethan Hawke&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Rick Yune&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;James Cromwell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1953, &#x27;name&#x27;: &#x27;Scott Hicks&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Parker Posey&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1973, &#x27;name&#x27;: &#x27;Dave Chappelle&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Steve Zahn&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1941, &#x27;name&#x27;: &#x27;Nora Ephron&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Rita Wilson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1953, &#x27;name&#x27;: &#x27;Bill Pullman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Victor Garber&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &quot;Rosie O&#x27;Donnell&quot;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1950, &#x27;name&#x27;: &#x27;John Patrick Stanley&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Nathan Lane&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1948, &#x27;name&#x27;: &#x27;Billy Crystal&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Carrie Fisher&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Bruno Kirby&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1977, &#x27;name&#x27;: &#x27;Liv Tyler&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1970, &#x27;name&#x27;: &#x27;Brooke Langton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1930, &#x27;name&#x27;: &#x27;Gene Hackman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Orlando Jones&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1950, &#x27;name&#x27;: &#x27;Howard Deutch&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1974, &#x27;name&#x27;: &#x27;Christian Bale&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1954, &#x27;name&#x27;: &#x27;Zach Grenier&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1931, &#x27;name&#x27;: &#x27;Mike Nichols&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1930, &#x27;name&#x27;: &#x27;Richard Harris&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1930, &#x27;name&#x27;: &#x27;Clint Eastwood&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1947, &#x27;name&#x27;: &#x27;Takeshi Kitano&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Dina Meyer&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Ice-T&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1953, &#x27;name&#x27;: &#x27;Robert Longo&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;Halle Berry&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Jim Broadbent&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Tom Tykwer&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1969, &#x27;name&#x27;: &#x27;David Mitchell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Stefan Arndt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1939, &#x27;name&#x27;: &#x27;Ian McKellen&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1976, &#x27;name&#x27;: &#x27;Audrey Tautou&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1971, &#x27;name&#x27;: &#x27;Paul Bettany&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1954, &#x27;name&#x27;: &#x27;Ron Howard&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1981, &#x27;name&#x27;: &#x27;Natalie Portman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1946, &#x27;name&#x27;: &#x27;Stephen Rea&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1940, &#x27;name&#x27;: &#x27;John Hurt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Ben Miles&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1985, &#x27;name&#x27;: &#x27;Emile Hirsch&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;John Goodman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1946, &#x27;name&#x27;: &#x27;Susan Sarandon&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1966, &#x27;name&#x27;: &#x27;Matthew Fox&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1980, &#x27;name&#x27;: &#x27;Christina Ricci&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1982, &#x27;name&#x27;: &#x27;Rain&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Naomie Harris&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1957, &#x27;name&#x27;: &#x27;Michael Clarke Duncan&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1953, &#x27;name&#x27;: &#x27;David Morse&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Sam Rockwell&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1955, &#x27;name&#x27;: &#x27;Gary Sinise&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1959, &#x27;name&#x27;: &#x27;Patricia Clarkson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1959, &#x27;name&#x27;: &#x27;Frank Darabont&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1938, &#x27;name&#x27;: &#x27;Frank Langella&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1969, &#x27;name&#x27;: &#x27;Michael Sheen&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Oliver Platt&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1944, &#x27;name&#x27;: &#x27;Danny DeVito&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;John C. Reilly&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1950, &#x27;name&#x27;: &#x27;Ed Harris&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1955, &#x27;name&#x27;: &#x27;Bill Paxton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Philip Seymour Hoffman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1943, &#x27;name&#x27;: &#x27;Jan de Bont&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1951, &#x27;name&#x27;: &#x27;Robert Zemeckis&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1932, &#x27;name&#x27;: &#x27;Milos Forman&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1946, &#x27;name&#x27;: &#x27;Diane Keaton&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1949, &#x27;name&#x27;: &#x27;Nancy Meyers&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Chris Columbus&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Julia Roberts&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1954, &#x27;name&#x27;: &#x27;Madonna&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Geena Davis&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Lori Petty&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1943, &#x27;name&#x27;: &#x27;Penny Marshall&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Paul Blythe&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Angela Scope&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;Jessica Thompson&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;name&#x27;: &#x27;James Thompson&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'born': 1967, 'name': 'Lilly Wachowski'}],\n",
       " [{'born': 1965, 'name': 'Lana Wachowski'}],\n",
       " [{'born': 1952, 'name': 'Joel Silver'}],\n",
       " [{'born': 1978, 'name': 'Emil Eifrem'}],\n",
       " [{'born': 1975, 'name': 'Charlize Theron'}],\n",
       " [{'born': 1940, 'name': 'Al Pacino'}],\n",
       " [{'born': 1944, 'name': 'Taylor Hackford'}],\n",
       " [{'born': 1962, 'name': 'Tom Cruise'}],\n",
       " [{'born': 1937, 'name': 'Jack Nicholson'}],\n",
       " [{'born': 1962, 'name': 'Demi Moore'}],\n",
       " [{'born': 1958, 'name': 'Kevin Bacon'}],\n",
       " [{'born': 1966, 'name': 'Kiefer Sutherland'}],\n",
       " [{'born': 1971, 'name': 'Noah Wyle'}],\n",
       " [{'born': 1968, 'name': 'Cuba Gooding Jr.'}],\n",
       " [{'born': 1957, 'name': 'Kevin Pollak'}],\n",
       " [{'born': 1943, 'name': 'J.T. Walsh'}],\n",
       " [{'born': 1967, 'name': 'James Marshall'}],\n",
       " [{'born': 1948, 'name': 'Christopher Guest'}],\n",
       " [{'born': 1947, 'name': 'Rob Reiner'}],\n",
       " [{'born': 1961, 'name': 'Aaron Sorkin'}],\n",
       " [{'born': 1957, 'name': 'Kelly McGillis'}],\n",
       " [{'born': 1959, 'name': 'Val Kilmer'}],\n",
       " [{'born': 1962, 'name': 'Anthony Edwards'}],\n",
       " [{'born': 1933, 'name': 'Tom Skerritt'}],\n",
       " [{'born': 1961, 'name': 'Meg Ryan'}],\n",
       " [{'born': 1944, 'name': 'Tony Scott'}],\n",
       " [{'born': 1941, 'name': 'Jim Cash'}],\n",
       " [{'born': 1969, 'name': 'Renee Zellweger'}],\n",
       " [{'born': 1962, 'name': 'Kelly Preston'}],\n",
       " [{'born': 1974, 'name': \"Jerry O'Connell\"}],\n",
       " [{'born': 1970, 'name': 'Jay Mohr'}],\n",
       " [{'born': 1961, 'name': 'Bonnie Hunt'}],\n",
       " [{'born': 1971, 'name': 'Regina King'}],\n",
       " [{'born': 1996, 'name': 'Jonathan Lipnicki'}],\n",
       " [{'born': 1957, 'name': 'Cameron Crowe'}],\n",
       " [{'born': 1970, 'name': 'River Phoenix'}],\n",
       " [{'born': 1971, 'name': 'Corey Feldman'}],\n",
       " [{'born': 1972, 'name': 'Wil Wheaton'}],\n",
       " [{'born': 1966, 'name': 'John Cusack'}],\n",
       " [{'born': 1942, 'name': 'Marshall Bell'}],\n",
       " [{'born': 1963, 'name': 'Helen Hunt'}],\n",
       " [{'born': 1963, 'name': 'Greg Kinnear'}],\n",
       " [{'born': 1940, 'name': 'James L. Brooks'}],\n",
       " [{'born': 1960, 'name': 'Annabella Sciorra'}],\n",
       " [{'born': 1929, 'name': 'Max von Sydow'}],\n",
       " [{'born': 1942, 'name': 'Werner Herzog'}],\n",
       " [{'born': 1951, 'name': 'Robin Williams'}],\n",
       " [{'born': 1956, 'name': 'Vincent Ward'}],\n",
       " [{'born': 1970, 'name': 'Ethan Hawke'}],\n",
       " [{'born': 1971, 'name': 'Rick Yune'}],\n",
       " [{'born': 1940, 'name': 'James Cromwell'}],\n",
       " [{'born': 1953, 'name': 'Scott Hicks'}],\n",
       " [{'born': 1968, 'name': 'Parker Posey'}],\n",
       " [{'born': 1973, 'name': 'Dave Chappelle'}],\n",
       " [{'born': 1967, 'name': 'Steve Zahn'}],\n",
       " [{'born': 1956, 'name': 'Tom Hanks'}],\n",
       " [{'born': 1941, 'name': 'Nora Ephron'}],\n",
       " [{'born': 1956, 'name': 'Rita Wilson'}],\n",
       " [{'born': 1953, 'name': 'Bill Pullman'}],\n",
       " [{'born': 1949, 'name': 'Victor Garber'}],\n",
       " [{'born': 1962, 'name': \"Rosie O'Donnell\"}],\n",
       " [{'born': 1950, 'name': 'John Patrick Stanley'}],\n",
       " [{'born': 1956, 'name': 'Nathan Lane'}],\n",
       " [{'born': 1948, 'name': 'Billy Crystal'}],\n",
       " [{'born': 1956, 'name': 'Carrie Fisher'}],\n",
       " [{'born': 1949, 'name': 'Bruno Kirby'}],\n",
       " [{'born': 1977, 'name': 'Liv Tyler'}],\n",
       " [{'born': 1970, 'name': 'Brooke Langton'}],\n",
       " [{'born': 1930, 'name': 'Gene Hackman'}],\n",
       " [{'born': 1968, 'name': 'Orlando Jones'}],\n",
       " [{'born': 1950, 'name': 'Howard Deutch'}],\n",
       " [{'born': 1974, 'name': 'Christian Bale'}],\n",
       " [{'born': 1954, 'name': 'Zach Grenier'}],\n",
       " [{'born': 1931, 'name': 'Mike Nichols'}],\n",
       " [{'born': 1930, 'name': 'Richard Harris'}],\n",
       " [{'born': 1930, 'name': 'Clint Eastwood'}],\n",
       " [{'born': 1947, 'name': 'Takeshi Kitano'}],\n",
       " [{'born': 1968, 'name': 'Dina Meyer'}],\n",
       " [{'born': 1958, 'name': 'Ice-T'}],\n",
       " [{'born': 1953, 'name': 'Robert Longo'}],\n",
       " [{'born': 1966, 'name': 'Halle Berry'}],\n",
       " [{'born': 1949, 'name': 'Jim Broadbent'}],\n",
       " [{'born': 1965, 'name': 'Tom Tykwer'}],\n",
       " [{'born': 1969, 'name': 'David Mitchell'}],\n",
       " [{'born': 1961, 'name': 'Stefan Arndt'}],\n",
       " [{'born': 1939, 'name': 'Ian McKellen'}],\n",
       " [{'born': 1976, 'name': 'Audrey Tautou'}],\n",
       " [{'born': 1971, 'name': 'Paul Bettany'}],\n",
       " [{'born': 1954, 'name': 'Ron Howard'}],\n",
       " [{'born': 1981, 'name': 'Natalie Portman'}],\n",
       " [{'born': 1946, 'name': 'Stephen Rea'}],\n",
       " [{'born': 1940, 'name': 'John Hurt'}],\n",
       " [{'born': 1967, 'name': 'Ben Miles'}],\n",
       " [{'born': 1985, 'name': 'Emile Hirsch'}],\n",
       " [{'born': 1960, 'name': 'John Goodman'}],\n",
       " [{'born': 1946, 'name': 'Susan Sarandon'}],\n",
       " [{'born': 1966, 'name': 'Matthew Fox'}],\n",
       " [{'born': 1980, 'name': 'Christina Ricci'}],\n",
       " [{'born': 1982, 'name': 'Rain'}],\n",
       " [{'name': 'Naomie Harris'}],\n",
       " [{'born': 1957, 'name': 'Michael Clarke Duncan'}],\n",
       " [{'born': 1953, 'name': 'David Morse'}],\n",
       " [{'born': 1968, 'name': 'Sam Rockwell'}],\n",
       " [{'born': 1955, 'name': 'Gary Sinise'}],\n",
       " [{'born': 1959, 'name': 'Patricia Clarkson'}],\n",
       " [{'born': 1959, 'name': 'Frank Darabont'}],\n",
       " [{'born': 1938, 'name': 'Frank Langella'}],\n",
       " [{'born': 1969, 'name': 'Michael Sheen'}],\n",
       " [{'born': 1960, 'name': 'Oliver Platt'}],\n",
       " [{'born': 1944, 'name': 'Danny DeVito'}],\n",
       " [{'born': 1965, 'name': 'John C. Reilly'}],\n",
       " [{'born': 1950, 'name': 'Ed Harris'}],\n",
       " [{'born': 1955, 'name': 'Bill Paxton'}],\n",
       " [{'born': 1967, 'name': 'Philip Seymour Hoffman'}],\n",
       " [{'born': 1943, 'name': 'Jan de Bont'}],\n",
       " [{'born': 1951, 'name': 'Robert Zemeckis'}],\n",
       " [{'born': 1932, 'name': 'Milos Forman'}],\n",
       " [{'born': 1946, 'name': 'Diane Keaton'}],\n",
       " [{'born': 1949, 'name': 'Nancy Meyers'}],\n",
       " [{'born': 1958, 'name': 'Chris Columbus'}],\n",
       " [{'born': 1967, 'name': 'Julia Roberts'}],\n",
       " [{'born': 1954, 'name': 'Madonna'}],\n",
       " [{'born': 1956, 'name': 'Geena Davis'}],\n",
       " [{'born': 1963, 'name': 'Lori Petty'}],\n",
       " [{'born': 1943, 'name': 'Penny Marshall'}],\n",
       " [{'name': 'Paul Blythe'}],\n",
       " [{'name': 'Angela Scope'}],\n",
       " [{'name': 'Jessica Thompson'}],\n",
       " [{'name': 'James Thompson'}]]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (n:Person) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the label of those nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "133 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>LABELS(n)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']],\n",
       " [['Person']]]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n:Person) RETURN LABELS(n)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the node of \"Tom Hanks\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (n:Person {name:\"Tom Hanks\"}) RETURN n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  Projections\n",
    "\n",
    "#### Get the title, release_year of movies\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "38 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "        <th>m.released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Reloaded</td>\n",
       "        <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Revolutions</td>\n",
       "        <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Top Gun</td>\n",
       "        <td>1986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry Maguire</td>\n",
       "        <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stand By Me</td>\n",
       "        <td>1986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "        <td>1993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "        <td>1990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Replacements</td>\n",
       "        <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RescueDawn</td>\n",
       "        <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Birdcage</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Unforgiven</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Johnny Mnemonic</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "        <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "        <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>V for Vendetta</td>\n",
       "        <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Speed Racer</td>\n",
       "        <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ninja Assassin</td>\n",
       "        <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frost/Nixon</td>\n",
       "        <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hoffa</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Twister</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "        <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>One Flew Over the Cuckoo&#x27;s Nest</td>\n",
       "        <td>1975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Something&#x27;s Gotta Give</td>\n",
       "        <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bicentennial Man</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "        <td>2007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "        <td>2004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix', 1999],\n",
       " ['The Matrix Reloaded', 2003],\n",
       " ['The Matrix Revolutions', 2003],\n",
       " [\"The Devil's Advocate\", 1997],\n",
       " ['A Few Good Men', 1992],\n",
       " ['Top Gun', 1986],\n",
       " ['Jerry Maguire', 2000],\n",
       " ['Stand By Me', 1986],\n",
       " ['As Good as It Gets', 1997],\n",
       " ['What Dreams May Come', 1998],\n",
       " ['Snow Falling on Cedars', 1999],\n",
       " [\"You've Got Mail\", 1998],\n",
       " ['Sleepless in Seattle', 1993],\n",
       " ['Joe Versus the Volcano', 1990],\n",
       " ['When Harry Met Sally', 1998],\n",
       " ['That Thing You Do', 1996],\n",
       " ['The Replacements', 2000],\n",
       " ['RescueDawn', 2006],\n",
       " ['The Birdcage', 1996],\n",
       " ['Unforgiven', 1992],\n",
       " ['Johnny Mnemonic', 1995],\n",
       " ['Cloud Atlas', 2012],\n",
       " ['The Da Vinci Code', 2006],\n",
       " ['V for Vendetta', 2006],\n",
       " ['Speed Racer', 2008],\n",
       " ['Ninja Assassin', 2009],\n",
       " ['The Green Mile', 1999],\n",
       " ['Frost/Nixon', 2008],\n",
       " ['Hoffa', 1992],\n",
       " ['Apollo 13', 1995],\n",
       " ['Twister', 1996],\n",
       " ['Cast Away', 2000],\n",
       " [\"One Flew Over the Cuckoo's Nest\", 1975],\n",
       " [\"Something's Gotta Give\", 2003],\n",
       " ['Bicentennial Man', 1999],\n",
       " [\"Charlie Wilson's War\", 2007],\n",
       " ['The Polar Express', 2004],\n",
       " ['A League of Their Own', 1992]]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "MATCH (m:Movie) \n",
    "RETURN m.title, m.released"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Matching By a relationship (Querying)\n",
    "#### Get the people and their relationships to movies (regardless of the type of the relationship)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m</th>\n",
       "        <th>p</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1978, &#x27;name&#x27;: &#x27;Emil Eifrem&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1952, &#x27;name&#x27;: &#x27;Joel Silver&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Lana Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Lilly Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1952, &#x27;name&#x27;: &#x27;Joel Silver&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1965, &#x27;name&#x27;: &#x27;Lana Wachowski&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1978, 'name': 'Emil Eifrem'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1952, 'name': 'Joel Silver'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1965, 'name': 'Lana Wachowski'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1967, 'name': 'Lilly Wachowski'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1952, 'name': 'Joel Silver'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1965, 'name': 'Lana Wachowski'}]]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (p:Person) -->(m:Movie) \n",
    "RETURN * LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get all the movies and people who acted in those movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m</th>\n",
       "        <th>p</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1978, &#x27;name&#x27;: &#x27;Emil Eifrem&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Welcome to the Real World&#x27;, &#x27;title&#x27;: &#x27;The Matrix&#x27;, &#x27;released&#x27;: 1999}</td>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1967, &#x27;name&#x27;: &#x27;Carrie-Anne Moss&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Free your mind&#x27;, &#x27;title&#x27;: &#x27;The Matrix Reloaded&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;tagline&#x27;: &#x27;Everything that has a beginning has an end&#x27;, &#x27;title&#x27;: &#x27;The Matrix Revolutions&#x27;, &#x27;released&#x27;: 2003}</td>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1978, 'name': 'Emil Eifrem'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'tagline': 'Welcome to the Real World',\n",
       "   'title': 'The Matrix',\n",
       "   'released': 1999},\n",
       "  {'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1961, 'name': 'Laurence Fishburne'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1967, 'name': 'Carrie-Anne Moss'}],\n",
       " [{'tagline': 'Free your mind',\n",
       "   'title': 'The Matrix Reloaded',\n",
       "   'released': 2003},\n",
       "  {'born': 1964, 'name': 'Keanu Reeves'}],\n",
       " [{'tagline': 'Everything that has a beginning has an end',\n",
       "   'title': 'The Matrix Revolutions',\n",
       "   'released': 2003},\n",
       "  {'born': 1960, 'name': 'Hugo Weaving'}]]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "MATCH (p:Person) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN * LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Filtering (WHERE Clause)\n",
    "\n",
    "####  What were the movies that \"Tom Hanks\" acted in"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Apollo 13'],\n",
       " [\"You've Got Mail\"],\n",
       " ['A League of Their Own'],\n",
       " ['Joe Versus the Volcano'],\n",
       " ['That Thing You Do'],\n",
       " ['The Da Vinci Code'],\n",
       " ['Cloud Atlas'],\n",
       " ['Cast Away'],\n",
       " ['The Green Mile'],\n",
       " ['Sleepless in Seattle'],\n",
       " ['The Polar Express'],\n",
       " [\"Charlie Wilson's War\"]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "MATCH (p:Person) -[:ACTED_IN]->(m:Movie) \n",
    "WHERE p.name=\"Tom Hanks\" \n",
    "RETURN m.title\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  What were the movies released in 1990s"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "19 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "        <th>m.released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "        <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "        <td>1993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "        <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Birdcage</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Unforgiven</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Johnny Mnemonic</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hoffa</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "        <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Twister</td>\n",
       "        <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bicentennial Man</td>\n",
       "        <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "        <td>1992</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix', 1999],\n",
       " [\"The Devil's Advocate\", 1997],\n",
       " ['A Few Good Men', 1992],\n",
       " ['As Good as It Gets', 1997],\n",
       " ['What Dreams May Come', 1998],\n",
       " ['Snow Falling on Cedars', 1999],\n",
       " [\"You've Got Mail\", 1998],\n",
       " ['Sleepless in Seattle', 1993],\n",
       " ['When Harry Met Sally', 1998],\n",
       " ['That Thing You Do', 1996],\n",
       " ['The Birdcage', 1996],\n",
       " ['Unforgiven', 1992],\n",
       " ['Johnny Mnemonic', 1995],\n",
       " ['The Green Mile', 1999],\n",
       " ['Hoffa', 1992],\n",
       " ['Apollo 13', 1995],\n",
       " ['Twister', 1996],\n",
       " ['Bicentennial Man', 1999],\n",
       " ['A League of Their Own', 1992]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (m:Movie) \n",
    "WHERE m.released>1990 AND m.released<2000 \n",
    "RETURN m.title, m.released\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Who Directed \"Cloud Atlas\"  movie?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Tykwer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lana Wachowski</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lilly Wachowski</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tom Tykwer'], ['Lana Wachowski'], ['Lilly Wachowski']]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "MATCH (p:Person) -[:DIRECTED]->(m:Movie) \n",
    "WHERE m.title=\"Cloud Atlas\" \n",
    "RETURN p.name\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get Actors and movies , but skip who also Directed Movie at all\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>p.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Marshall</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Werner Herzog</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Clint Eastwood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Danny DeVito</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['James Marshall'],\n",
       " ['Werner Herzog'],\n",
       " ['Tom Hanks'],\n",
       " ['Clint Eastwood'],\n",
       " ['Danny DeVito']]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (p:Person)-[:ACTED_IN]->(m)\n",
    "WHERE (p)-[:DIRECTED]->()\n",
    "RETURN DISTINCT p.name"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  Unique Results (Distinct)\n",
    "#### Get DISTINCT Labels in your GraphDB\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>Labels</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Movie&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Person&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Movie']], [['Person']]]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n) \n",
    "RETURN DISTINCT labels(n) AS Labels\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  Get Tom Hanks Co-Actors (and in which movies)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "39 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>coActors.name</th>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ed Harris</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gary Sinise</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kevin Bacon</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Paxton</td>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Parker Posey</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Greg Kinnear</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Steve Zahn</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dave Chappelle</td>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Madonna</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Geena Davis</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Paxton</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lori Petty</td>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nathan Lane</td>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Liv Tyler</td>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlize Theron</td>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ian McKellen</td>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Audrey Tautou</td>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Paul Bettany</td>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Helen Hunt</td>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sam Rockwell</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bonnie Hunt</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Patricia Clarkson</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Cromwell</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Michael Clarke Duncan</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>David Morse</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gary Sinise</td>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Victor Garber</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Pullman</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rita Wilson</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Julia Roberts</td>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Philip Seymour Hoffman</td>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Ed Harris', 'Apollo 13'],\n",
       " ['Gary Sinise', 'Apollo 13'],\n",
       " ['Kevin Bacon', 'Apollo 13'],\n",
       " ['Bill Paxton', 'Apollo 13'],\n",
       " ['Parker Posey', \"You've Got Mail\"],\n",
       " ['Greg Kinnear', \"You've Got Mail\"],\n",
       " ['Meg Ryan', \"You've Got Mail\"],\n",
       " ['Steve Zahn', \"You've Got Mail\"],\n",
       " ['Dave Chappelle', \"You've Got Mail\"],\n",
       " ['Madonna', 'A League of Their Own'],\n",
       " [\"Rosie O'Donnell\", 'A League of Their Own'],\n",
       " ['Geena Davis', 'A League of Their Own'],\n",
       " ['Bill Paxton', 'A League of Their Own'],\n",
       " ['Lori Petty', 'A League of Their Own'],\n",
       " ['Nathan Lane', 'Joe Versus the Volcano'],\n",
       " ['Meg Ryan', 'Joe Versus the Volcano'],\n",
       " ['Liv Tyler', 'That Thing You Do'],\n",
       " ['Charlize Theron', 'That Thing You Do'],\n",
       " ['Ian McKellen', 'The Da Vinci Code'],\n",
       " ['Audrey Tautou', 'The Da Vinci Code'],\n",
       " ['Paul Bettany', 'The Da Vinci Code'],\n",
       " ['Jim Broadbent', 'Cloud Atlas'],\n",
       " ['Halle Berry', 'Cloud Atlas'],\n",
       " ['Hugo Weaving', 'Cloud Atlas'],\n",
       " ['Helen Hunt', 'Cast Away'],\n",
       " ['Sam Rockwell', 'The Green Mile'],\n",
       " ['Bonnie Hunt', 'The Green Mile'],\n",
       " ['Patricia Clarkson', 'The Green Mile'],\n",
       " ['James Cromwell', 'The Green Mile'],\n",
       " ['Michael Clarke Duncan', 'The Green Mile'],\n",
       " ['David Morse', 'The Green Mile'],\n",
       " ['Gary Sinise', 'The Green Mile'],\n",
       " ['Meg Ryan', 'Sleepless in Seattle'],\n",
       " ['Victor Garber', 'Sleepless in Seattle'],\n",
       " ['Bill Pullman', 'Sleepless in Seattle'],\n",
       " ['Rita Wilson', 'Sleepless in Seattle'],\n",
       " [\"Rosie O'Donnell\", 'Sleepless in Seattle'],\n",
       " ['Julia Roberts', \"Charlie Wilson's War\"],\n",
       " ['Philip Seymour Hoffman', \"Charlie Wilson's War\"]]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie)<-[:ACTED_IN]-(coActors) \n",
    "RETURN coActors.name, m.title"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### How people are related to (Acted_IN, Directed, Produced, etc) to the \"Cloud Atlas\" movie?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>people.name</th>\n",
       "        <th>Type(relatedTo)</th>\n",
       "        <th>roles_if_Actor</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Zachry&#x27;, &#x27;Dr. Henry Goose&#x27;, &#x27;Isaac Sachs&#x27;, &#x27;Dermot Hoggins&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Vyvyan Ayrs&#x27;, &#x27;Captain Molyneux&#x27;, &#x27;Timothy Cavendish&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>David Mitchell</td>\n",
       "        <td>WROTE</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Tykwer</td>\n",
       "        <td>DIRECTED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lana Wachowski</td>\n",
       "        <td>DIRECTED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stefan Arndt</td>\n",
       "        <td>PRODUCED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jessica Thompson</td>\n",
       "        <td>REVIEWED</td>\n",
       "        <td>{&#x27;summary&#x27;: &#x27;An amazing journey&#x27;, &#x27;rating&#x27;: 95}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Luisa Rey&#x27;, &#x27;Jocasta Ayrs&#x27;, &#x27;Ovid&#x27;, &#x27;Meronym&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "        <td>ACTED_IN</td>\n",
       "        <td>{&#x27;roles&#x27;: [&#x27;Bill Smoke&#x27;, &#x27;Haskell Moore&#x27;, &#x27;Tadeusz Kesselring&#x27;, &#x27;Nurse Noakes&#x27;, &#x27;Boardman Mephi&#x27;, &#x27;Old Georgie&#x27;]}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lilly Wachowski</td>\n",
       "        <td>DIRECTED</td>\n",
       "        <td>{}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tom Hanks',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Zachry', 'Dr. Henry Goose', 'Isaac Sachs', 'Dermot Hoggins']}],\n",
       " ['Jim Broadbent',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Vyvyan Ayrs', 'Captain Molyneux', 'Timothy Cavendish']}],\n",
       " ['David Mitchell', 'WROTE', {}],\n",
       " ['Tom Tykwer', 'DIRECTED', {}],\n",
       " ['Lana Wachowski', 'DIRECTED', {}],\n",
       " ['Stefan Arndt', 'PRODUCED', {}],\n",
       " ['Jessica Thompson',\n",
       "  'REVIEWED',\n",
       "  {'summary': 'An amazing journey', 'rating': 95}],\n",
       " ['Halle Berry',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Luisa Rey', 'Jocasta Ayrs', 'Ovid', 'Meronym']}],\n",
       " ['Hugo Weaving',\n",
       "  'ACTED_IN',\n",
       "  {'roles': ['Bill Smoke',\n",
       "    'Haskell Moore',\n",
       "    'Tadeusz Kesselring',\n",
       "    'Nurse Noakes',\n",
       "    'Boardman Mephi',\n",
       "    'Old Georgie']}],\n",
       " ['Lilly Wachowski', 'DIRECTED', {}]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "\n",
    "MATCH (people:Person)-[relatedTo]-(:Movie {title: \"Cloud Atlas\"}) \n",
    "RETURN people.name, Type(relatedTo), relatedTo As roles_if_Actor\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " #### Get the movies that \"Tom Hanks\" Acted in and also Directed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['That Thing You Do']]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (tom:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) <-[:DIRECTED]-(tom) \n",
    "RETURN m.title"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "###  LIMIT&&SKIP\n",
    "####  Get the movies that \"Tom Hanks\" Acted, skip the first movie and get the next following two ones.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['A League of Their Own'], ['Joe Versus the Volcano'], ['That Thing You Do']]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m) \n",
    "RETURN m.title \n",
    "SKIP 2 \n",
    "LIMIT 3\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ORDER BY\n",
    "#### Get the movies that \"Tom Hanks\" Acted ordered by the title"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['A League of Their Own'],\n",
       " ['Apollo 13'],\n",
       " ['Cast Away'],\n",
       " [\"Charlie Wilson's War\"],\n",
       " ['Cloud Atlas'],\n",
       " ['Joe Versus the Volcano'],\n",
       " ['Sleepless in Seattle'],\n",
       " ['That Thing You Do'],\n",
       " ['The Da Vinci Code'],\n",
       " ['The Green Mile'],\n",
       " ['The Polar Express'],\n",
       " [\"You've Got Mail\"]]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN m.title \n",
    "ORDER BY m.title\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cypher Aggregation Functions\n",
    "#### Get the count of Movies acted by \"Tom Hanks\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>TomCount</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[12]]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN COUNT(*) As TomCount"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  Get the top 10 profilic actors (Actors who made the most apperances in movies)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>a</th>\n",
       "        <th>appearances</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1956, &#x27;name&#x27;: &#x27;Tom Hanks&#x27;}</td>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1964, &#x27;name&#x27;: &#x27;Keanu Reeves&#x27;}</td>\n",
       "        <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1960, &#x27;name&#x27;: &#x27;Hugo Weaving&#x27;}</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Meg Ryan&#x27;}</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1937, &#x27;name&#x27;: &#x27;Jack Nicholson&#x27;}</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1968, &#x27;name&#x27;: &#x27;Cuba Gooding Jr.&#x27;}</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1961, &#x27;name&#x27;: &#x27;Laurence Fishburne&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1962, &#x27;name&#x27;: &#x27;Tom Cruise&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1963, &#x27;name&#x27;: &#x27;Helen Hunt&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;born&#x27;: 1958, &#x27;name&#x27;: &#x27;Kevin Bacon&#x27;}</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'born': 1956, 'name': 'Tom Hanks'}, 12],\n",
       " [{'born': 1964, 'name': 'Keanu Reeves'}, 7],\n",
       " [{'born': 1960, 'name': 'Hugo Weaving'}, 5],\n",
       " [{'born': 1961, 'name': 'Meg Ryan'}, 5],\n",
       " [{'born': 1937, 'name': 'Jack Nicholson'}, 5],\n",
       " [{'born': 1968, 'name': 'Cuba Gooding Jr.'}, 4],\n",
       " [{'born': 1961, 'name': 'Laurence Fishburne'}, 3],\n",
       " [{'born': 1962, 'name': 'Tom Cruise'}, 3],\n",
       " [{'born': 1963, 'name': 'Helen Hunt'}, 3],\n",
       " [{'born': 1958, 'name': 'Kevin Bacon'}, 3]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (a:Person)-[:ACTED_IN]->(m:Movie)\n",
    "RETURN a, count(*) AS appearances\n",
    "ORDER BY appearances DESC LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### What is the released year of the most recent movie acted by \"Tom Hanks\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>MAX(m.released)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2012</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[2012]]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (:Person{name:\"Tom Hanks\"}) -[:ACTED_IN]->(m:Movie) \n",
    "RETURN MAX(m.released)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### For each movie, get the list of actors (cast), and their count."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "38 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>movie</th>\n",
       "        <th>cast</th>\n",
       "        <th>actors</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix</td>\n",
       "        <td>[&#x27;Emil Eifrem&#x27;, &#x27;Hugo Weaving&#x27;, &#x27;Laurence Fishburne&#x27;, &#x27;Carrie-Anne Moss&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Reloaded</td>\n",
       "        <td>[&#x27;Hugo Weaving&#x27;, &#x27;Laurence Fishburne&#x27;, &#x27;Carrie-Anne Moss&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Matrix Revolutions</td>\n",
       "        <td>[&#x27;Hugo Weaving&#x27;, &#x27;Laurence Fishburne&#x27;, &#x27;Carrie-Anne Moss&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Devil&#x27;s Advocate</td>\n",
       "        <td>[&#x27;Al Pacino&#x27;, &#x27;Charlize Theron&#x27;, &#x27;Keanu Reeves&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A Few Good Men</td>\n",
       "        <td>[&#x27;James Marshall&#x27;, &#x27;Kevin Pollak&#x27;, &#x27;J.T. Walsh&#x27;, &#x27;Aaron Sorkin&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Christopher Guest&#x27;, &#x27;Noah Wyle&#x27;, &#x27;Kiefer Sutherland&#x27;, &#x27;Kevin Bacon&#x27;, &#x27;Demi Moore&#x27;, &#x27;Jack Nicholson&#x27;, &#x27;Tom Cruise&#x27;]</td>\n",
       "        <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Top Gun</td>\n",
       "        <td>[&#x27;Val Kilmer&#x27;, &#x27;Meg Ryan&#x27;, &#x27;Tom Skerritt&#x27;, &#x27;Kelly McGillis&#x27;, &#x27;Tom Cruise&#x27;, &#x27;Anthony Edwards&#x27;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry Maguire</td>\n",
       "        <td>[&quot;Jerry O&#x27;Connell&quot;, &#x27;Bonnie Hunt&#x27;, &#x27;Jay Mohr&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Jonathan Lipnicki&#x27;, &#x27;Renee Zellweger&#x27;, &#x27;Kelly Preston&#x27;, &#x27;Regina King&#x27;, &#x27;Tom Cruise&#x27;]</td>\n",
       "        <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stand By Me</td>\n",
       "        <td>[&quot;Jerry O&#x27;Connell&quot;, &#x27;River Phoenix&#x27;, &#x27;Marshall Bell&#x27;, &#x27;Wil Wheaton&#x27;, &#x27;Kiefer Sutherland&#x27;, &#x27;John Cusack&#x27;, &#x27;Corey Feldman&#x27;]</td>\n",
       "        <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>As Good as It Gets</td>\n",
       "        <td>[&#x27;Helen Hunt&#x27;, &#x27;Jack Nicholson&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Greg Kinnear&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>What Dreams May Come</td>\n",
       "        <td>[&#x27;Robin Williams&#x27;, &#x27;Cuba Gooding Jr.&#x27;, &#x27;Max von Sydow&#x27;, &#x27;Werner Herzog&#x27;, &#x27;Annabella Sciorra&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Snow Falling on Cedars</td>\n",
       "        <td>[&#x27;Ethan Hawke&#x27;, &#x27;Rick Yune&#x27;, &#x27;Max von Sydow&#x27;, &#x27;James Cromwell&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>You&#x27;ve Got Mail</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Parker Posey&#x27;, &#x27;Greg Kinnear&#x27;, &#x27;Meg Ryan&#x27;, &#x27;Steve Zahn&#x27;, &#x27;Dave Chappelle&#x27;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sleepless in Seattle</td>\n",
       "        <td>[&#x27;Meg Ryan&#x27;, &#x27;Victor Garber&#x27;, &#x27;Tom Hanks&#x27;, &#x27;Bill Pullman&#x27;, &#x27;Rita Wilson&#x27;, &quot;Rosie O&#x27;Donnell&quot;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joe Versus the Volcano</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Nathan Lane&#x27;, &#x27;Meg Ryan&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>When Harry Met Sally</td>\n",
       "        <td>[&#x27;Carrie Fisher&#x27;, &#x27;Billy Crystal&#x27;, &#x27;Bruno Kirby&#x27;, &#x27;Meg Ryan&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>That Thing You Do</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Liv Tyler&#x27;, &#x27;Charlize Theron&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Replacements</td>\n",
       "        <td>[&#x27;Brooke Langton&#x27;, &#x27;Keanu Reeves&#x27;, &#x27;Orlando Jones&#x27;, &#x27;Gene Hackman&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>RescueDawn</td>\n",
       "        <td>[&#x27;Zach Grenier&#x27;, &#x27;Steve Zahn&#x27;, &#x27;Christian Bale&#x27;, &#x27;Marshall Bell&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Birdcage</td>\n",
       "        <td>[&#x27;Robin Williams&#x27;, &#x27;Nathan Lane&#x27;, &#x27;Gene Hackman&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Unforgiven</td>\n",
       "        <td>[&#x27;Clint Eastwood&#x27;, &#x27;Gene Hackman&#x27;, &#x27;Richard Harris&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Johnny Mnemonic</td>\n",
       "        <td>[&#x27;Ice-T&#x27;, &#x27;Dina Meyer&#x27;, &#x27;Keanu Reeves&#x27;, &#x27;Takeshi Kitano&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Jim Broadbent&#x27;, &#x27;Halle Berry&#x27;, &#x27;Hugo Weaving&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Da Vinci Code</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Ian McKellen&#x27;, &#x27;Audrey Tautou&#x27;, &#x27;Paul Bettany&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>V for Vendetta</td>\n",
       "        <td>[&#x27;John Hurt&#x27;, &#x27;Stephen Rea&#x27;, &#x27;Natalie Portman&#x27;, &#x27;Hugo Weaving&#x27;, &#x27;Ben Miles&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Speed Racer</td>\n",
       "        <td>[&#x27;Emile Hirsch&#x27;, &#x27;Rain&#x27;, &#x27;Christina Ricci&#x27;, &#x27;Ben Miles&#x27;, &#x27;Susan Sarandon&#x27;, &#x27;John Goodman&#x27;, &#x27;Matthew Fox&#x27;]</td>\n",
       "        <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ninja Assassin</td>\n",
       "        <td>[&#x27;Rain&#x27;, &#x27;Ben Miles&#x27;, &#x27;Rick Yune&#x27;, &#x27;Naomie Harris&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Green Mile</td>\n",
       "        <td>[&#x27;Sam Rockwell&#x27;, &#x27;Bonnie Hunt&#x27;, &#x27;Patricia Clarkson&#x27;, &#x27;James Cromwell&#x27;, &#x27;Tom Hanks&#x27;, &#x27;Michael Clarke Duncan&#x27;, &#x27;David Morse&#x27;, &#x27;Gary Sinise&#x27;]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frost/Nixon</td>\n",
       "        <td>[&#x27;Sam Rockwell&#x27;, &#x27;Michael Sheen&#x27;, &#x27;Frank Langella&#x27;, &#x27;Oliver Platt&#x27;, &#x27;Kevin Bacon&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hoffa</td>\n",
       "        <td>[&#x27;John C. Reilly&#x27;, &#x27;Danny DeVito&#x27;, &#x27;J.T. Walsh&#x27;, &#x27;Jack Nicholson&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Apollo 13</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Ed Harris&#x27;, &#x27;Gary Sinise&#x27;, &#x27;Kevin Bacon&#x27;, &#x27;Bill Paxton&#x27;]</td>\n",
       "        <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Twister</td>\n",
       "        <td>[&#x27;Helen Hunt&#x27;, &#x27;Bill Paxton&#x27;, &#x27;Philip Seymour Hoffman&#x27;, &#x27;Zach Grenier&#x27;]</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cast Away</td>\n",
       "        <td>[&#x27;Helen Hunt&#x27;, &#x27;Tom Hanks&#x27;]</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>One Flew Over the Cuckoo&#x27;s Nest</td>\n",
       "        <td>[&#x27;Danny DeVito&#x27;, &#x27;Jack Nicholson&#x27;]</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Something&#x27;s Gotta Give</td>\n",
       "        <td>[&#x27;Keanu Reeves&#x27;, &#x27;Diane Keaton&#x27;, &#x27;Jack Nicholson&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bicentennial Man</td>\n",
       "        <td>[&#x27;Robin Williams&#x27;, &#x27;Oliver Platt&#x27;]</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlie Wilson&#x27;s War</td>\n",
       "        <td>[&#x27;Julia Roberts&#x27;, &#x27;Tom Hanks&#x27;, &#x27;Philip Seymour Hoffman&#x27;]</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>The Polar Express</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;]</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>A League of Their Own</td>\n",
       "        <td>[&#x27;Tom Hanks&#x27;, &#x27;Madonna&#x27;, &quot;Rosie O&#x27;Donnell&quot;, &#x27;Geena Davis&#x27;, &#x27;Bill Paxton&#x27;, &#x27;Lori Petty&#x27;]</td>\n",
       "        <td>6</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['The Matrix',\n",
       "  ['Emil Eifrem',\n",
       "   'Hugo Weaving',\n",
       "   'Laurence Fishburne',\n",
       "   'Carrie-Anne Moss',\n",
       "   'Keanu Reeves'],\n",
       "  5],\n",
       " ['The Matrix Reloaded',\n",
       "  ['Hugo Weaving', 'Laurence Fishburne', 'Carrie-Anne Moss', 'Keanu Reeves'],\n",
       "  4],\n",
       " ['The Matrix Revolutions',\n",
       "  ['Hugo Weaving', 'Laurence Fishburne', 'Carrie-Anne Moss', 'Keanu Reeves'],\n",
       "  4],\n",
       " [\"The Devil's Advocate\", ['Al Pacino', 'Charlize Theron', 'Keanu Reeves'], 3],\n",
       " ['A Few Good Men',\n",
       "  ['James Marshall',\n",
       "   'Kevin Pollak',\n",
       "   'J.T. Walsh',\n",
       "   'Aaron Sorkin',\n",
       "   'Cuba Gooding Jr.',\n",
       "   'Christopher Guest',\n",
       "   'Noah Wyle',\n",
       "   'Kiefer Sutherland',\n",
       "   'Kevin Bacon',\n",
       "   'Demi Moore',\n",
       "   'Jack Nicholson',\n",
       "   'Tom Cruise'],\n",
       "  12],\n",
       " ['Top Gun',\n",
       "  ['Val Kilmer',\n",
       "   'Meg Ryan',\n",
       "   'Tom Skerritt',\n",
       "   'Kelly McGillis',\n",
       "   'Tom Cruise',\n",
       "   'Anthony Edwards'],\n",
       "  6],\n",
       " ['Jerry Maguire',\n",
       "  [\"Jerry O'Connell\",\n",
       "   'Bonnie Hunt',\n",
       "   'Jay Mohr',\n",
       "   'Cuba Gooding Jr.',\n",
       "   'Jonathan Lipnicki',\n",
       "   'Renee Zellweger',\n",
       "   'Kelly Preston',\n",
       "   'Regina King',\n",
       "   'Tom Cruise'],\n",
       "  9],\n",
       " ['Stand By Me',\n",
       "  [\"Jerry O'Connell\",\n",
       "   'River Phoenix',\n",
       "   'Marshall Bell',\n",
       "   'Wil Wheaton',\n",
       "   'Kiefer Sutherland',\n",
       "   'John Cusack',\n",
       "   'Corey Feldman'],\n",
       "  7],\n",
       " ['As Good as It Gets',\n",
       "  ['Helen Hunt', 'Jack Nicholson', 'Cuba Gooding Jr.', 'Greg Kinnear'],\n",
       "  4],\n",
       " ['What Dreams May Come',\n",
       "  ['Robin Williams',\n",
       "   'Cuba Gooding Jr.',\n",
       "   'Max von Sydow',\n",
       "   'Werner Herzog',\n",
       "   'Annabella Sciorra'],\n",
       "  5],\n",
       " ['Snow Falling on Cedars',\n",
       "  ['Ethan Hawke', 'Rick Yune', 'Max von Sydow', 'James Cromwell'],\n",
       "  4],\n",
       " [\"You've Got Mail\",\n",
       "  ['Tom Hanks',\n",
       "   'Parker Posey',\n",
       "   'Greg Kinnear',\n",
       "   'Meg Ryan',\n",
       "   'Steve Zahn',\n",
       "   'Dave Chappelle'],\n",
       "  6],\n",
       " ['Sleepless in Seattle',\n",
       "  ['Meg Ryan',\n",
       "   'Victor Garber',\n",
       "   'Tom Hanks',\n",
       "   'Bill Pullman',\n",
       "   'Rita Wilson',\n",
       "   \"Rosie O'Donnell\"],\n",
       "  6],\n",
       " ['Joe Versus the Volcano', ['Tom Hanks', 'Nathan Lane', 'Meg Ryan'], 3],\n",
       " ['When Harry Met Sally',\n",
       "  ['Carrie Fisher', 'Billy Crystal', 'Bruno Kirby', 'Meg Ryan'],\n",
       "  4],\n",
       " ['That Thing You Do', ['Tom Hanks', 'Liv Tyler', 'Charlize Theron'], 3],\n",
       " ['The Replacements',\n",
       "  ['Brooke Langton', 'Keanu Reeves', 'Orlando Jones', 'Gene Hackman'],\n",
       "  4],\n",
       " ['RescueDawn',\n",
       "  ['Zach Grenier', 'Steve Zahn', 'Christian Bale', 'Marshall Bell'],\n",
       "  4],\n",
       " ['The Birdcage', ['Robin Williams', 'Nathan Lane', 'Gene Hackman'], 3],\n",
       " ['Unforgiven', ['Clint Eastwood', 'Gene Hackman', 'Richard Harris'], 3],\n",
       " ['Johnny Mnemonic',\n",
       "  ['Ice-T', 'Dina Meyer', 'Keanu Reeves', 'Takeshi Kitano'],\n",
       "  4],\n",
       " ['Cloud Atlas',\n",
       "  ['Tom Hanks', 'Jim Broadbent', 'Halle Berry', 'Hugo Weaving'],\n",
       "  4],\n",
       " ['The Da Vinci Code',\n",
       "  ['Tom Hanks', 'Ian McKellen', 'Audrey Tautou', 'Paul Bettany'],\n",
       "  4],\n",
       " ['V for Vendetta',\n",
       "  ['John Hurt', 'Stephen Rea', 'Natalie Portman', 'Hugo Weaving', 'Ben Miles'],\n",
       "  5],\n",
       " ['Speed Racer',\n",
       "  ['Emile Hirsch',\n",
       "   'Rain',\n",
       "   'Christina Ricci',\n",
       "   'Ben Miles',\n",
       "   'Susan Sarandon',\n",
       "   'John Goodman',\n",
       "   'Matthew Fox'],\n",
       "  7],\n",
       " ['Ninja Assassin', ['Rain', 'Ben Miles', 'Rick Yune', 'Naomie Harris'], 4],\n",
       " ['The Green Mile',\n",
       "  ['Sam Rockwell',\n",
       "   'Bonnie Hunt',\n",
       "   'Patricia Clarkson',\n",
       "   'James Cromwell',\n",
       "   'Tom Hanks',\n",
       "   'Michael Clarke Duncan',\n",
       "   'David Morse',\n",
       "   'Gary Sinise'],\n",
       "  8],\n",
       " ['Frost/Nixon',\n",
       "  ['Sam Rockwell',\n",
       "   'Michael Sheen',\n",
       "   'Frank Langella',\n",
       "   'Oliver Platt',\n",
       "   'Kevin Bacon'],\n",
       "  5],\n",
       " ['Hoffa',\n",
       "  ['John C. Reilly', 'Danny DeVito', 'J.T. Walsh', 'Jack Nicholson'],\n",
       "  4],\n",
       " ['Apollo 13',\n",
       "  ['Tom Hanks', 'Ed Harris', 'Gary Sinise', 'Kevin Bacon', 'Bill Paxton'],\n",
       "  5],\n",
       " ['Twister',\n",
       "  ['Helen Hunt', 'Bill Paxton', 'Philip Seymour Hoffman', 'Zach Grenier'],\n",
       "  4],\n",
       " ['Cast Away', ['Helen Hunt', 'Tom Hanks'], 2],\n",
       " [\"One Flew Over the Cuckoo's Nest\", ['Danny DeVito', 'Jack Nicholson'], 2],\n",
       " [\"Something's Gotta Give\",\n",
       "  ['Keanu Reeves', 'Diane Keaton', 'Jack Nicholson'],\n",
       "  3],\n",
       " ['Bicentennial Man', ['Robin Williams', 'Oliver Platt'], 2],\n",
       " [\"Charlie Wilson's War\",\n",
       "  ['Julia Roberts', 'Tom Hanks', 'Philip Seymour Hoffman'],\n",
       "  3],\n",
       " ['The Polar Express', ['Tom Hanks'], 1],\n",
       " ['A League of Their Own',\n",
       "  ['Tom Hanks',\n",
       "   'Madonna',\n",
       "   \"Rosie O'Donnell\",\n",
       "   'Geena Davis',\n",
       "   'Bill Paxton',\n",
       "   'Lori Petty'],\n",
       "  6]]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (m:Movie)<-[:ACTED_IN]-(a:Person)\n",
    "RETURN m.title AS movie, collect(a.name) AS cast, count(*) AS actors"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the first 3 movies of each actor"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "102 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n.name</th>\n",
       "        <th>movies</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Keanu Reeves</td>\n",
       "        <td>[&quot;Something&#x27;s Gotta Give&quot;, &#x27;The Replacements&#x27;, &#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Carrie-Anne Moss</td>\n",
       "        <td>[&#x27;The Matrix Revolutions&#x27;, &#x27;The Matrix Reloaded&#x27;, &#x27;The Matrix&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Laurence Fishburne</td>\n",
       "        <td>[&#x27;The Matrix Revolutions&#x27;, &#x27;The Matrix Reloaded&#x27;, &#x27;The Matrix&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Hugo Weaving</td>\n",
       "        <td>[&#x27;Cloud Atlas&#x27;, &#x27;V for Vendetta&#x27;, &#x27;The Matrix Revolutions&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Emil Eifrem</td>\n",
       "        <td>[&#x27;The Matrix&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Charlize Theron</td>\n",
       "        <td>[&#x27;That Thing You Do&#x27;, &quot;The Devil&#x27;s Advocate&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Al Pacino</td>\n",
       "        <td>[&quot;The Devil&#x27;s Advocate&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Cruise</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;, &#x27;Top Gun&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jack Nicholson</td>\n",
       "        <td>[&#x27;As Good as It Gets&#x27;, &quot;One Flew Over the Cuckoo&#x27;s Nest&quot;, &quot;Something&#x27;s Gotta Give&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Demi Moore</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kevin Bacon</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;, &#x27;Frost/Nixon&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kiefer Sutherland</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Noah Wyle</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cuba Gooding Jr.</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;, &#x27;Jerry Maguire&#x27;, &#x27;As Good as It Gets&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kevin Pollak</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>J.T. Walsh</td>\n",
       "        <td>[&#x27;Hoffa&#x27;, &#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Marshall</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Christopher Guest</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Aaron Sorkin</td>\n",
       "        <td>[&#x27;A Few Good Men&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kelly McGillis</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Val Kilmer</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Anthony Edwards</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Skerritt</td>\n",
       "        <td>[&#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Meg Ryan</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;, &quot;You&#x27;ve Got Mail&quot;, &#x27;Top Gun&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Renee Zellweger</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Kelly Preston</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jerry O&#x27;Connell</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;, &#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jay Mohr</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bonnie Hunt</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;, &#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Regina King</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jonathan Lipnicki</td>\n",
       "        <td>[&#x27;Jerry Maguire&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>River Phoenix</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Corey Feldman</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Wil Wheaton</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Cusack</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Marshall Bell</td>\n",
       "        <td>[&#x27;Stand By Me&#x27;, &#x27;RescueDawn&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Helen Hunt</td>\n",
       "        <td>[&#x27;As Good as It Gets&#x27;, &#x27;Cast Away&#x27;, &#x27;Twister&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Greg Kinnear</td>\n",
       "        <td>[&quot;You&#x27;ve Got Mail&quot;, &#x27;As Good as It Gets&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Annabella Sciorra</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Max von Sydow</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;, &#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Werner Herzog</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robin Williams</td>\n",
       "        <td>[&#x27;What Dreams May Come&#x27;, &#x27;Bicentennial Man&#x27;, &#x27;The Birdcage&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ethan Hawke</td>\n",
       "        <td>[&#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rick Yune</td>\n",
       "        <td>[&#x27;Ninja Assassin&#x27;, &#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>James Cromwell</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;, &#x27;Snow Falling on Cedars&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Parker Posey</td>\n",
       "        <td>[&quot;You&#x27;ve Got Mail&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dave Chappelle</td>\n",
       "        <td>[&quot;You&#x27;ve Got Mail&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Steve Zahn</td>\n",
       "        <td>[&#x27;RescueDawn&#x27;, &quot;You&#x27;ve Got Mail&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tom Hanks</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;, &quot;You&#x27;ve Got Mail&quot;, &#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rita Wilson</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Pullman</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Victor Garber</td>\n",
       "        <td>[&#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rosie O&#x27;Donnell</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;, &#x27;Sleepless in Seattle&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nathan Lane</td>\n",
       "        <td>[&#x27;Joe Versus the Volcano&#x27;, &#x27;The Birdcage&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Billy Crystal</td>\n",
       "        <td>[&#x27;When Harry Met Sally&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Carrie Fisher</td>\n",
       "        <td>[&#x27;When Harry Met Sally&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bruno Kirby</td>\n",
       "        <td>[&#x27;When Harry Met Sally&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Liv Tyler</td>\n",
       "        <td>[&#x27;That Thing You Do&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Brooke Langton</td>\n",
       "        <td>[&#x27;The Replacements&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gene Hackman</td>\n",
       "        <td>[&#x27;Unforgiven&#x27;, &#x27;The Birdcage&#x27;, &#x27;The Replacements&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Orlando Jones</td>\n",
       "        <td>[&#x27;The Replacements&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Christian Bale</td>\n",
       "        <td>[&#x27;RescueDawn&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Zach Grenier</td>\n",
       "        <td>[&#x27;RescueDawn&#x27;, &#x27;Twister&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Richard Harris</td>\n",
       "        <td>[&#x27;Unforgiven&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Clint Eastwood</td>\n",
       "        <td>[&#x27;Unforgiven&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Takeshi Kitano</td>\n",
       "        <td>[&#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Dina Meyer</td>\n",
       "        <td>[&#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ice-T</td>\n",
       "        <td>[&#x27;Johnny Mnemonic&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Halle Berry</td>\n",
       "        <td>[&#x27;Cloud Atlas&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jim Broadbent</td>\n",
       "        <td>[&#x27;Cloud Atlas&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ian McKellen</td>\n",
       "        <td>[&#x27;The Da Vinci Code&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Audrey Tautou</td>\n",
       "        <td>[&#x27;The Da Vinci Code&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Paul Bettany</td>\n",
       "        <td>[&#x27;The Da Vinci Code&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Natalie Portman</td>\n",
       "        <td>[&#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stephen Rea</td>\n",
       "        <td>[&#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Hurt</td>\n",
       "        <td>[&#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ben Miles</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;, &#x27;Ninja Assassin&#x27;, &#x27;V for Vendetta&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Emile Hirsch</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John Goodman</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Susan Sarandon</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Matthew Fox</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Christina Ricci</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Rain</td>\n",
       "        <td>[&#x27;Speed Racer&#x27;, &#x27;Ninja Assassin&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Naomie Harris</td>\n",
       "        <td>[&#x27;Ninja Assassin&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Michael Clarke Duncan</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>David Morse</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sam Rockwell</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;, &#x27;Frost/Nixon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gary Sinise</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;, &#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Patricia Clarkson</td>\n",
       "        <td>[&#x27;The Green Mile&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Frank Langella</td>\n",
       "        <td>[&#x27;Frost/Nixon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Michael Sheen</td>\n",
       "        <td>[&#x27;Frost/Nixon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Oliver Platt</td>\n",
       "        <td>[&#x27;Frost/Nixon&#x27;, &#x27;Bicentennial Man&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Danny DeVito</td>\n",
       "        <td>[&#x27;Hoffa&#x27;, &quot;One Flew Over the Cuckoo&#x27;s Nest&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>John C. Reilly</td>\n",
       "        <td>[&#x27;Hoffa&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ed Harris</td>\n",
       "        <td>[&#x27;Apollo 13&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bill Paxton</td>\n",
       "        <td>[&#x27;Twister&#x27;, &#x27;A League of Their Own&#x27;, &#x27;Apollo 13&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Philip Seymour Hoffman</td>\n",
       "        <td>[&#x27;Twister&#x27;, &quot;Charlie Wilson&#x27;s War&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Diane Keaton</td>\n",
       "        <td>[&quot;Something&#x27;s Gotta Give&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Julia Roberts</td>\n",
       "        <td>[&quot;Charlie Wilson&#x27;s War&quot;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Madonna</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Geena Davis</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Lori Petty</td>\n",
       "        <td>[&#x27;A League of Their Own&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Keanu Reeves',\n",
       "  [\"Something's Gotta Give\", 'The Replacements', 'Johnny Mnemonic']],\n",
       " ['Carrie-Anne Moss',\n",
       "  ['The Matrix Revolutions', 'The Matrix Reloaded', 'The Matrix']],\n",
       " ['Laurence Fishburne',\n",
       "  ['The Matrix Revolutions', 'The Matrix Reloaded', 'The Matrix']],\n",
       " ['Hugo Weaving', ['Cloud Atlas', 'V for Vendetta', 'The Matrix Revolutions']],\n",
       " ['Emil Eifrem', ['The Matrix']],\n",
       " ['Charlize Theron', ['That Thing You Do', \"The Devil's Advocate\"]],\n",
       " ['Al Pacino', [\"The Devil's Advocate\"]],\n",
       " ['Tom Cruise', ['Jerry Maguire', 'Top Gun', 'A Few Good Men']],\n",
       " ['Jack Nicholson',\n",
       "  ['As Good as It Gets',\n",
       "   \"One Flew Over the Cuckoo's Nest\",\n",
       "   \"Something's Gotta Give\"]],\n",
       " ['Demi Moore', ['A Few Good Men']],\n",
       " ['Kevin Bacon', ['Apollo 13', 'Frost/Nixon', 'A Few Good Men']],\n",
       " ['Kiefer Sutherland', ['Stand By Me', 'A Few Good Men']],\n",
       " ['Noah Wyle', ['A Few Good Men']],\n",
       " ['Cuba Gooding Jr.',\n",
       "  ['What Dreams May Come', 'Jerry Maguire', 'As Good as It Gets']],\n",
       " ['Kevin Pollak', ['A Few Good Men']],\n",
       " ['J.T. Walsh', ['Hoffa', 'A Few Good Men']],\n",
       " ['James Marshall', ['A Few Good Men']],\n",
       " ['Christopher Guest', ['A Few Good Men']],\n",
       " ['Aaron Sorkin', ['A Few Good Men']],\n",
       " ['Kelly McGillis', ['Top Gun']],\n",
       " ['Val Kilmer', ['Top Gun']],\n",
       " ['Anthony Edwards', ['Top Gun']],\n",
       " ['Tom Skerritt', ['Top Gun']],\n",
       " ['Meg Ryan', ['Sleepless in Seattle', \"You've Got Mail\", 'Top Gun']],\n",
       " ['Renee Zellweger', ['Jerry Maguire']],\n",
       " ['Kelly Preston', ['Jerry Maguire']],\n",
       " [\"Jerry O'Connell\", ['Jerry Maguire', 'Stand By Me']],\n",
       " ['Jay Mohr', ['Jerry Maguire']],\n",
       " ['Bonnie Hunt', ['The Green Mile', 'Jerry Maguire']],\n",
       " ['Regina King', ['Jerry Maguire']],\n",
       " ['Jonathan Lipnicki', ['Jerry Maguire']],\n",
       " ['River Phoenix', ['Stand By Me']],\n",
       " ['Corey Feldman', ['Stand By Me']],\n",
       " ['Wil Wheaton', ['Stand By Me']],\n",
       " ['John Cusack', ['Stand By Me']],\n",
       " ['Marshall Bell', ['Stand By Me', 'RescueDawn']],\n",
       " ['Helen Hunt', ['As Good as It Gets', 'Cast Away', 'Twister']],\n",
       " ['Greg Kinnear', [\"You've Got Mail\", 'As Good as It Gets']],\n",
       " ['Annabella Sciorra', ['What Dreams May Come']],\n",
       " ['Max von Sydow', ['What Dreams May Come', 'Snow Falling on Cedars']],\n",
       " ['Werner Herzog', ['What Dreams May Come']],\n",
       " ['Robin Williams',\n",
       "  ['What Dreams May Come', 'Bicentennial Man', 'The Birdcage']],\n",
       " ['Ethan Hawke', ['Snow Falling on Cedars']],\n",
       " ['Rick Yune', ['Ninja Assassin', 'Snow Falling on Cedars']],\n",
       " ['James Cromwell', ['The Green Mile', 'Snow Falling on Cedars']],\n",
       " ['Parker Posey', [\"You've Got Mail\"]],\n",
       " ['Dave Chappelle', [\"You've Got Mail\"]],\n",
       " ['Steve Zahn', ['RescueDawn', \"You've Got Mail\"]],\n",
       " ['Tom Hanks', ['Apollo 13', \"You've Got Mail\", 'A League of Their Own']],\n",
       " ['Rita Wilson', ['Sleepless in Seattle']],\n",
       " ['Bill Pullman', ['Sleepless in Seattle']],\n",
       " ['Victor Garber', ['Sleepless in Seattle']],\n",
       " [\"Rosie O'Donnell\", ['A League of Their Own', 'Sleepless in Seattle']],\n",
       " ['Nathan Lane', ['Joe Versus the Volcano', 'The Birdcage']],\n",
       " ['Billy Crystal', ['When Harry Met Sally']],\n",
       " ['Carrie Fisher', ['When Harry Met Sally']],\n",
       " ['Bruno Kirby', ['When Harry Met Sally']],\n",
       " ['Liv Tyler', ['That Thing You Do']],\n",
       " ['Brooke Langton', ['The Replacements']],\n",
       " ['Gene Hackman', ['Unforgiven', 'The Birdcage', 'The Replacements']],\n",
       " ['Orlando Jones', ['The Replacements']],\n",
       " ['Christian Bale', ['RescueDawn']],\n",
       " ['Zach Grenier', ['RescueDawn', 'Twister']],\n",
       " ['Richard Harris', ['Unforgiven']],\n",
       " ['Clint Eastwood', ['Unforgiven']],\n",
       " ['Takeshi Kitano', ['Johnny Mnemonic']],\n",
       " ['Dina Meyer', ['Johnny Mnemonic']],\n",
       " ['Ice-T', ['Johnny Mnemonic']],\n",
       " ['Halle Berry', ['Cloud Atlas']],\n",
       " ['Jim Broadbent', ['Cloud Atlas']],\n",
       " ['Ian McKellen', ['The Da Vinci Code']],\n",
       " ['Audrey Tautou', ['The Da Vinci Code']],\n",
       " ['Paul Bettany', ['The Da Vinci Code']],\n",
       " ['Natalie Portman', ['V for Vendetta']],\n",
       " ['Stephen Rea', ['V for Vendetta']],\n",
       " ['John Hurt', ['V for Vendetta']],\n",
       " ['Ben Miles', ['Speed Racer', 'Ninja Assassin', 'V for Vendetta']],\n",
       " ['Emile Hirsch', ['Speed Racer']],\n",
       " ['John Goodman', ['Speed Racer']],\n",
       " ['Susan Sarandon', ['Speed Racer']],\n",
       " ['Matthew Fox', ['Speed Racer']],\n",
       " ['Christina Ricci', ['Speed Racer']],\n",
       " ['Rain', ['Speed Racer', 'Ninja Assassin']],\n",
       " ['Naomie Harris', ['Ninja Assassin']],\n",
       " ['Michael Clarke Duncan', ['The Green Mile']],\n",
       " ['David Morse', ['The Green Mile']],\n",
       " ['Sam Rockwell', ['The Green Mile', 'Frost/Nixon']],\n",
       " ['Gary Sinise', ['Apollo 13', 'The Green Mile']],\n",
       " ['Patricia Clarkson', ['The Green Mile']],\n",
       " ['Frank Langella', ['Frost/Nixon']],\n",
       " ['Michael Sheen', ['Frost/Nixon']],\n",
       " ['Oliver Platt', ['Frost/Nixon', 'Bicentennial Man']],\n",
       " ['Danny DeVito', ['Hoffa', \"One Flew Over the Cuckoo's Nest\"]],\n",
       " ['John C. Reilly', ['Hoffa']],\n",
       " ['Ed Harris', ['Apollo 13']],\n",
       " ['Bill Paxton', ['Twister', 'A League of Their Own', 'Apollo 13']],\n",
       " ['Philip Seymour Hoffman', ['Twister', \"Charlie Wilson's War\"]],\n",
       " ['Diane Keaton', [\"Something's Gotta Give\"]],\n",
       " ['Julia Roberts', [\"Charlie Wilson's War\"]],\n",
       " ['Madonna', ['A League of Their Own']],\n",
       " ['Geena Davis', ['A League of Their Own']],\n",
       " ['Lori Petty', ['A League of Their Own']]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n:Person)-[:ACTED_IN]-(m)\n",
    "Return n.name , \n",
    "collect(m.title)[..3] as movies"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### WITH Clause\n",
    "#### Get the First 3 People in the DB ordered descending by the name into a list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>collect(n.name)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[&#x27;Zach Grenier&#x27;, &#x27;Wil Wheaton&#x27;, &#x27;Werner Herzog&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[['Zach Grenier', 'Wil Wheaton', 'Werner Herzog']]]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (n:Person) \n",
    "WITH n \n",
    "ORDER BY n.name DESC \n",
    "LIMIT 3 \n",
    "RETURN collect(n.name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the title of the most recent movie acted by Tom Hanks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>m.title</th>\n",
       "        <th>m.released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cloud Atlas</td>\n",
       "        <td>2012</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Cloud Atlas', 2012]]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "MATCH (p:Person{name:\"Tom Hanks\"})-[:ACTED_IN]->(m:Movie) \n",
    "WITH MAX(m.released) AS max \n",
    "MATCH (m:Movie{released:max}) \n",
    "RETURN m.title,m.released"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# THANK YOU, and GOOD LUCK!"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
